[
  {
    "id": 0,
    "content": "          Challenging myself is one of my default attributes, as long as I can remember. I have\n      tried joining different sports teams, clubs, tried playing instruments to sort of play my life at a\n      higher difficulty, which is kind of weird, but all worth it in the end because there was always\n      some sort of life lesson learned.\n      But as you know we dont have a lot of time and if I spend this much of my time learning\n      life lessons, I have to be efficient with my time to maintain my academic standings (which is\n      what actually matters), because if not I wouldnt even be here. So I would study hard, grind\n      questionbanks, and go to class to focus, focus..., and then I would think of todays lunch, and\n      then the next thing you know, the school bell would ring.\n      Basically, focusing in class was impossible, especially with lecture material being\n      presented this way. And thats a problem, a massive problem, because my grades, and at that\n      time, my life was on the line.\n      Being the grumpy adolescent I was, I would think: 'Yeah I think I can do better than that'"
  },
  {
    "id": 1,
    "content": "          And so I did! I added improving presentations to my list of challenges, and went on a\n      journey of attempts to improve the quality of presentations. I tried using different formats,\n      different structures, different styles, and finally I may have just found the answer through my\n      latest attempt:\n      Presentations are stories. But I'm not a writer. In fact, I was never the brightest in\n      language & literature. So I went with the most logical approach when brainstorming this\n      presentation:\n      ● What is the current situation I want to address?\n      ● What complication exists in the situation that needs to be solved?\n      ● What is the question that arises from the complication?\n      ● What is the answer to the question?\n      Which happens to follow the SCQA framework, used for creating presentation storylines. Well\n      for this presentation::\n      ● Situation\n      ○ Communication is important when projecting ideas especially towards a large\n      audience\n      ● Complication\n      ○ With the current presentation format, I deduce that this is not easy since it lacks\n      the ability to maintain audience attention\n\n      ● Question\n      ○ Is there a particular way to structure or method to increase the quality of\n      presentation in terms of audience attention?"
  },
  {
    "id": 2,
    "content": "          to a smart group of people whom the majority would have presented at least once this week.\n      Everybody knows how to present! So while I was staring at my computer, I thought maybe I\n      might need to find a special technique to enhance our presentation.\n\n      But there really isn't. To be honest, what practical technique is there to be elaborated?\n      Voice projection, physical language, positioning? Really, it's all common knowledge regardless\n      of how well we present. But clearly, there is a quality discrepancy in different presentations.\n      There's what is considered a great presentation and one that is not as good. So then what\n      makes a great presentation?\n      This is certainly not an easy question to answer, because it's quite tricky to properly\n      measure something that is very intuitive. But if I sample the target population and ask the right\n      questions, maybe I can discover something that can answer what makes a presentation great.\n      You see, a few weeks ago, I sent a small questionnaire to a group of Korean-Canadians\n      regarding which of the three aspects of presentation they spend the most time on:\n      ● Content\n      ○ Presentation topic, Research outcomes\n      ● Structure\n      ○ Scriptwriting, Presentation visuals\n      ● Execution\n      ○ Voice projection, Physical language, Pronunciation, Tone"
  },
  {
    "id": 3,
    "content": "      When asked: Which is the most important aspect for presentations?\n  It seems that regardless of how confident or how experienced they were in presenting\n  towards a large audience, there was a large emphasis on the execution of the presentation so\n  much so that on average, people spend at least 30% more time on both the content and the\n  execution than the scriptwriting and presentation visuals.\n  So the main focus of presentations is the execution, but should it be that way? Because\n  at the end of the day, the quality of execution is limited by how well you write your script and\n  prepare your visuals, the quality of structure is limited by how clear and well-researched your\n  topic is, and the quality of content is limited by how well it is articulated towards your audience.\n  It's a cycle that should have an equal importance with each other. And to put these elements in\n  equal footing, all we need to do is to care more about our presentations.\n  The quality of an idea is measured by how well it is communicated. Sometimes it doesn't\n  matter how brilliant or how well-researched the topic is, it's about how it is presented towards\n  others. Like how the quality of learning depends on how the material is presented, or how the\n  innovations of a company have its values enhanced by its product showcases. “The most\n  powerful person in the world is a storyteller. The storyteller sets the vision, values, and agenda\n  of an entire generation that is to come.” (Steve Jobs). A great presenter understands that the\n  presentations have the potential to change the human mind."
  },
  {
    "id": 4,
    "content": "visuals, we can omit words from slides because as we all say a picture is worth a thousand\nwords. With physical movements, we can direct the attention back to the speaker or we can\ndirect it back to the presentation, and with a good combination of these tools, we can turn these\ninto a bright idea (lighting bulb slide).\nBy simply caring about presentations, it unlocks a new thinking process that evokes\ncreativity and brings your ideas to life in front of a large audience.\nBecause a presentation is not a speech nor is it just a slideshow, it's a narrative with the\npresenter having the responsibility to guide the audience through what could be a\nvision-changing experience.\n\nSometimes this may all seem like a waste of time. After all, this may be near the bottom\nof our priorities. But out of the numerous challenges I took, preparing a presentation was one of\nthe best challenges I've had yet, because there's such a big return to it. You gain so many\nuseful skills that ironically helped with many of my higher priority targets.\n\n● Imagining myself presenting lecture material brought me to ask the right\nquestions and learn course content more effectively\n● Narrating the skill sets in my resume into a story during interviews lead to more\nquestions out of interest\n● Writing an abstract with a smooth flow may just have helped me to get to this\npresentation"
  },
  {
    "id": 5,
    "content": "That's why I care about presentations; that's why we should care about presentations.\nPresentations are stories. I'm not a writer, and I know not much about what everyone\nelse knows about presenting. However, I understand that simply caring about presentation can\nimprove our presentations since it gets us thinking outside of the box on how presentations are\nnormally prepared.\nAnd we care because preparing presentations provides valuable sets of skills used for\nachieving high priority goals.\nWe care because it has the potential to change the mind, and set the vision as said by\none of the greatest storytellers to ever live.\nThis gives me the Answer to complete the SCQA framework for my presentation, my\nstory on how to prepare an effective presentation. Thank you."
  }
]
